Podkova/src/Catalogs/СервисПровайдерыСУЗ/СервисПровайдерыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СервисПровайдерыСУЗ</name>
  <attributes>
    <name>ВидСервисПровайдера</name>
    <type>
      <types>EnumRef.ВидыСервисПровайдеровСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыПродукции</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Podkova/src/Enums/ВидыСервисПровайдеровСУЗ/ВидыСервисПровайдеровСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСервисПровайдеровСУЗ</name>
  <enumValues>
    <name>ЦЭМ</name>
  </enumValues>
  <enumValues>
    <name>КонтрактноеПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическийСклад</name>
  </enumValues>
  <enumValues>
    <name>КомиссионнаяПлощадка</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Catalogs/СервисПровайдерыСУЗ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	УстановитьПредставлениеВидовПродукции(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ВидыПродукции.Количество() = 0 Тогда
		ТекстСообщения = Нстр("ru = 'Не введено ни одной строки в список ""Виды продукции""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ВидыПродукцииПредставление",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидСервисПровайдераПриИзменении(Элемент)
	
	УстановитьСтранаТолькоРоссия(ЭтотОбъект);
	
	Россия = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	
	Если СтранаТолькоРоссия И Объект.Страна <> Россия Тогда
		Объект.Страна = Россия;
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыПродукцииПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ВыбранныеВидыПродукции", СформироватьМассивВидовПродукции());
	
	ОткрытьФорму(
		"Справочник.СервисПровайдерыСУЗ.Форма.ФормаВыбораВидовПродукции",
		ПараметрыОткрытия,
		ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ВидыПродукцииЗавершениеВыбора", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПриИзмененииРеквизитов

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеВидовПродукции(Форма)
	
	Объект = Форма.Объект;
	
	Форма.КоличествоВидовПродукции = Объект.ВидыПродукции.Количество();
	
	Если Форма.КоличествоВидовПродукции = 0 Тогда
		Форма.ВидыПродукцииПредставление = НСтр("ru = 'Выбрать'");
		Возврат ;
	КонецЕсли;
	
	Представление = "";
	ПредставлениеДлина = 0;
	МаксимальнаяДлина = 60;
	КоличествоДобавлено = 0;
	
	Разделитель = ", ";
	ТекстОкончанияСтроки = НСтр("ru = ' ( + еще %1 )'");
	
	Для Каждого СтрокаВидыПродукции Из Объект.ВидыПродукции Цикл
		
		ТекущееПредставление = Строка(СтрокаВидыПродукции.ВидПродукции);
		Если КоличествоДобавлено > 0 Тогда
			ТекущееПредставление = Разделитель + ТекущееПредставление;
		КонецЕсли;
			
		ПредставлениеДлина = ПредставлениеДлина + СтрДлина(ТекущееПредставление);
		
		Если Форма.КоличествоВидовПродукции = КоличествоДобавлено + 1 Тогда
			МаксимальнаяДлина = МаксимальнаяДлина + СтрДлина(ТекстОкончанияСтроки);
		КонецЕсли;
		
		Если ПредставлениеДлина > МаксимальнаяДлина И КоличествоДобавлено > 0 Тогда
			Представление = Представление + СтрШаблон(ТекстОкончанияСтроки, Форма.КоличествоВидовПродукции - КоличествоДобавлено);
			Прервать;
		КонецЕсли;
		
		Представление = Представление + ТекущееПредставление;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	Форма.ВидыПродукцииПредставление = Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыПродукцииЗавершениеВыбора(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВидыПродукции.Очистить();
	
	Для Каждого ВидПродукции Из Результат Цикл
		СтрокаВидыПродукции = Объект.ВидыПродукции.Добавить();
		СтрокаВидыПродукции.ВидПродукции = ВидПродукции;
	КонецЦикла;
	
	ЭтотОбъект.Модифицированность = Истина;
	
	УстановитьПредставлениеВидовПродукции(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидыПродукцииПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("КоличествоВидовПродукции");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	УправлениеПараметрамиВыбораРеквизитовФормы();
	
	УстановитьСтранаТолькоРоссия(ЭтотОбъект);
	
	ОбновитьВидимостьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПараметрамиВыбораРеквизитовФормы()
	
	Массив = Новый Массив;
	
	Массив.Добавить(Новый ПараметрВыбора("Отбор.УчастникЕАЭС", Истина));
	Элементы.Страна.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьДоступностьЭлементовФормы(Форма)
	
	Форма.Элементы.Страна.Доступность = Не Форма.СтранаТолькоРоссия;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтранаТолькоРоссия(Форма)
	
	Форма.СтранаТолькоРоссия = Форма.Объект.ВидСервисПровайдера = ПредопределенноеЗначение("Перечисление.ВидыСервисПровайдеровСУЗ.ЦЭМ")
		Или Форма.Объект.ВидСервисПровайдера = ПредопределенноеЗначение("Перечисление.ВидыСервисПровайдеровСУЗ.КомиссионнаяПлощадка");
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМассивВидовПродукции()
	
	ВыбранныеВидыПродукции = Новый Массив;
	
	Для Каждого СтрокаВидыПродукции Из Объект.ВидыПродукции Цикл
		ВыбранныеВидыПродукции.Добавить(СтрокаВидыПродукции.ВидПродукции);
	КонецЦикла;
	
	Возврат ВыбранныеВидыПродукции;
	
КонецФункции

#КонецОбласти

#КонецОбласти
